20240325T204305--kdoc-131-今さらopenapi-v31の変更点を知る__wiki.org
:properties:
:ID: 20240325T204305
:mtime:    20241103085500
:ctime:    20241028101410
:end:
#+title:      KDOC 131: 今さらOpenAPI v3.1の変更点を知る
#+date:       [2024-03-25 Mon 20:43]
#+filetags:   :wiki:
#+identifier: 20240325T204305

* この文書のステータス
- 作成
  - [X] 2024-03-25 貴島
- レビュー
  - [X] 2024-04-27 貴島

* 概要
雰囲気で[[id:a833c386-3cca-49eb-969a-5af58991250d][OpenAPI]]を使ってコード生成していた。コード生成ライブラリのバージョンを上げたところnullableまわりの生成コードが変になり、動かなくなった。具体的には、nullableにしてもバリデーションされる。何かライブラリの不具合だろうか、と考えてバージョンアップせずそのままにしていた。しばらくしても直らない。ちゃんとチェックしている人とっては当然なのだろうが、これはOpenAPI v3.0->v3.1の破壊的変更である。

- [[https://www.openapis.org/blog/2021/02/16/migrating-from-openapi-3-0-to-3-1-0][Migrating from OpenAPI 3.0 to 3.1.0 - OpenAPI Initiative]]

自分は最初からv3.1で書いているつもりだったので、何も気づかなかった。おそらくコード生成ライブラリがOpenAPI v3.1に対応してから、今まで動いていたコードが壊れた。v2->v3の変更にだけ気をつけていればよく、v2時代に書いてないので関係ないと考えていた。

教訓。

- ちゃんとドキュメントを読んでキャッチアップしよう
- ネット情報はバージョンを確認しよう
- 生成コードをちゃんとテストしよう

* nullable

まさにこれだった。変更したところ、元の通り生成されるようになった。

#+caption: v3.0
#+begin_src shell
type: string
nullable: true
#+end_src

#+caption: v3.1
#+begin_src shell
type:
- "string"
- "null"
#+end_src

* 関連
なし。
