20240325T204305--kdoc-131-今さらopenapi-v31の変更点を知る__wiki.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-11T23:12:56Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 131: 今さらOpenAPI v3.1の変更点を知る</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 131: 今さらOpenAPI v3.1の変更点を知る</h1>
<div id="outline-container-orgd96372c" class="outline-2">
<h2 id="orgd96372c"><a href="#orgd96372c">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-orgd96372c">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-03-25 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-04-27 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org570fcf1" class="outline-2">
<h2 id="org570fcf1"><a href="#org570fcf1">概要</a></h2>
<div class="outline-text-2" id="text-org570fcf1">
<p>
雰囲気で<a href="20230119001157-openapi.html#ID-a833c386-3cca-49eb-969a-5af58991250d">OpenAPI</a>を使ってコード生成していた。コード生成ライブラリのバージョンを上げたところnullableまわりの生成コードが変になり、動かなくなった。具体的には、nullableにしてもバリデーションされる。何かライブラリの不具合だろうか、と考えてバージョンアップせずそのままにしていた。しばらくしても直らない。ちゃんとチェックしている人とっては当然なのだろうが、これはOpenAPI v3.0-&gt;v3.1の破壊的変更である。
</p>

<ul class="org-ul">
<li><a href="https://www.openapis.org/blog/2021/02/16/migrating-from-openapi-3-0-to-3-1-0">Migrating from OpenAPI 3.0 to 3.1.0 - OpenAPI Initiative</a></li>
</ul>

<p>
自分は最初からv3.1で書いているつもりだったので、何も気づかなかった。おそらくコード生成ライブラリがOpenAPI v3.1に対応してから、今まで動いていたコードが壊れた。v2-&gt;v3の変更にだけ気をつけていればよく、v2時代に書いてないので関係ないと考えていた。
</p>

<p>
教訓。
</p>

<ul class="org-ul">
<li>ちゃんとドキュメントを読んでキャッチアップしよう</li>
<li>ネット情報はバージョンを確認しよう</li>
<li>生成コードをちゃんとテストしよう</li>
</ul>
</div>
</div>
<div id="outline-container-org197768d" class="outline-2">
<h2 id="org197768d"><a href="#org197768d">nullable</a></h2>
<div class="outline-text-2" id="text-org197768d">
<p>
まさにこれだった。変更したところ、元の通り生成されるようになった。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>v3.0</label><pre class="src src-shell"><span class="org-builtin">type</span>: string
nullable: true
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>v3.1</label><pre class="src src-shell"><span class="org-builtin">type</span>:
- <span class="org-string">"string"</span>
- <span class="org-string">"null"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org250b30f" class="outline-2">
<h2 id="org250b30f"><a href="#org250b30f">関連</a></h2>
<div class="outline-text-2" id="text-org250b30f">
<p>
なし。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
